[
  {
    "image": "https://i.ibb.co.com/2171Ld1g/snappix.webp",
    "title": "SnapPix",
    "companyName": "PixelSoft Studios",
    "id": 1,
    "description": "SnapPix is your ultimate companion for capturing and transforming everyday moments into stunning visuals. With a wide range of AI-powered filters, artistic effects, and intuitive editing tools, SnapPix makes professional-quality photo editing simple and fun for everyone. Whether you're creating social media posts, personal memories, or professional content, SnapPix helps you enhance, crop, retouch, and stylize your images effortlessly. Explore endless creativity with our library of stickers, frames, and unique overlays. SnapPix is optimized for speed, performance, and user-friendly navigation, making it perfect for beginners and pros alike. Share your masterpieces instantly with friends and followers, and keep your memories beautifully organized in one secure place. With continuous updates and innovative features, SnapPix ensures that your creative journey never stops. Transform ordinary snapshots into extraordinary art and experience photography like never before.",
    "size": 45.8,
    "reviews": 12458,
    "ratingAvg": 4.5,
    "downloads": 2500000,
    "ratings": [
      { "name": "1 star", "count": 350 },
      { "name": "2 star", "count": 420 },
      { "name": "3 star", "count": 890 },
      { "name": "4 star", "count": 2650 },
      { "name": "5 star", "count": 8148 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Wps08y7X/fittrack.webp",
    "title": "FitTrack Pro",
    "companyName": "Wellness Works Inc.",
    "id": 2,
    "description": "FitTrack Pro is your personal fitness companion designed to help you achieve your health goals efficiently and safely. Track workouts, monitor your nutrition, and keep an eye on your sleep patterns with accurate, real-time insights. FitTrack Pro offers customizable workout plans for all levels, from beginners to advanced athletes, and provides detailed analytics to help you optimize performance. The app includes interactive challenges, milestone rewards, and friendly reminders to keep you motivated. With an intuitive interface and seamless syncing across devices, you can log your progress anywhere, anytime. Discover expert tips, nutritional guidance, and personalized routines to enhance your fitness journey. FitTrack Pro is more than just a tracker; it's your personal coach and motivator, helping you build a healthier, stronger, and more active lifestyle, all within one beautifully designed app.",
    "size": 72.3,
    "reviews": 8021,
    "ratingAvg": 4.2,
    "downloads": 1800000,
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 3200 },
      { "name": "5 star", "count": 2921 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/pvvBwDcY/notenest.webp",
    "title": "NoteNest",
    "companyName": "Cloudy Labs",
    "id": 3,
    "description": "NoteNest is the smart way to capture your thoughts, ideas, and tasks in one organized digital space. With NoteNest, you can quickly jot down notes, create checklists, attach files, and categorize everything with intuitive tags and folders. Designed for both productivity enthusiasts and casual users, NoteNest syncs seamlessly across devices so your notes are always accessible, whether on mobile, tablet, or desktop. Rich formatting tools, voice-to-text support, and customizable templates help you create notes that fit your personal style. Collaborate with colleagues, share ideas, and track project progress with ease. NoteNest combines simplicity and powerful organization tools, making it perfect for students, professionals, and anyone looking to stay on top of their daily tasks. Experience a new level of clarity, focus, and creativity, all in one sleek, user-friendly app.",
    "size": 38.6,
    "reviews": 6570,
    "ratingAvg": 4.7,
    "downloads": 2100000,
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 620 },
      { "name": "4 star", "count": 1900 },
      { "name": "5 star", "count": 3770 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/V0P5SKh3/tunebox.webp",
    "title": "TuneBox",
    "companyName": "Harmony Labs",
    "id": 4,
    "description": "TuneBox delivers an immersive music experience, letting you stream millions of songs, playlists, and podcasts with unmatched clarity. Discover new tracks and curated playlists tailored to your taste, or create your own collections to suit every mood and activity. TuneBox offers offline listening, high-fidelity audio, and personalized recommendations powered by AI, ensuring you never miss a beat. Explore podcasts on trending topics, follow your favorite artists, and stay up-to-date with new releases. The app is designed with a sleek interface that makes navigation effortless, providing a smooth and enjoyable listening experience. With social sharing options and smart library organization, TuneBox keeps your music journey vibrant, fun, and personalized. Whether you’re relaxing, working, or working out, TuneBox brings music to life exactly the way you want it.",
    "size": 95.4,
    "reviews": 21890,
    "ratingAvg": 4.6,
    "downloads": 8000000,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 5200 },
      { "name": "5 star", "count": 11000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HLhBw0fh/cityrider.jpg",
    "title": "CityRider",
    "companyName": "UrbanTech Mobility",
    "id": 5,
    "description": "CityRider makes urban commuting effortless and flexible. Instantly book bikes, scooters, or cabs, and navigate your city with ease and confidence. With real-time tracking, transparent pricing, and smart route suggestions, CityRider helps you save time and enjoy a smooth ride. Designed for busy city dwellers, CityRider offers secure payment options, customizable ride preferences, and safety notifications for peace of mind. Plan trips in advance or ride spontaneously — the app adapts to your schedule. With a clean, intuitive interface and reliable vehicle availability, CityRider transforms everyday transportation into a convenient and enjoyable experience. Whether you’re heading to work, exploring the city, or running errands, CityRider makes moving around faster, safer, and smarter.",
    "size": 64.2,
    "reviews": 9350,
    "ratingAvg": 3.9,
    "downloads": 3400000,
    "ratings": [
      { "name": "1 star", "count": 1300 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 1950 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/4R5FzqFK/langly.jpg",
    "title": "Langly",
    "companyName": "EduNova Ltd.",
    "id": 6,
    "description": "Langly turns language learning into an exciting, interactive journey. Whether you’re starting a new language or polishing existing skills, Langly’s engaging lessons, quizzes, and speech recognition tools help you learn effectively. Track your progress with visual dashboards, receive personalized recommendations, and participate in challenges to stay motivated. Langly covers vocabulary, grammar, and pronunciation, offering real-life conversational exercises that make learning practical and enjoyable. With offline mode, immersive content, and AI-powered tips, Langly adapts to your pace and learning style. Whether for travel, work, or personal enrichment, Langly empowers you to communicate confidently and broaden your horizons. Dive into a new language and experience a fun, rewarding, and efficient way to learn with Langly.",
    "size": 89.5,
    "reviews": 17400,
    "ratingAvg": 4.8,
    "downloads": 5000000,
    "ratings": [
      { "name": "1 star", "count": 250 },
      { "name": "2 star", "count": 320 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 12130 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/7NXBHgXr/budgetbuddy.png",
    "title": "BudgetBuddy",
    "companyName": "Finwise Apps",
    "id": 7,
    "description": "BudgetBuddy makes managing your finances simple and stress-free. Track spending, create budgets, and monitor savings goals in one convenient app. With real-time insights, visual analytics, and automated reminders, BudgetBuddy helps you make smarter financial decisions and stay on top of bills and subscriptions. Secure your accounts with industry-standard encryption and gain a clear overview of your income and expenses. Personalized recommendations guide you toward saving more efficiently and reducing unnecessary spending. Whether you’re managing personal finances, family budgets, or small business accounts, BudgetBuddy adapts to your lifestyle, empowering you to gain control, build wealth, and achieve your financial goals with confidence.",
    "size": 52.7,
    "reviews": 8120,
    "ratingAvg": 4.3,
    "downloads": 2300000,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 3620 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/m5w33xQp/quickdoc.webp",
    "title": "QuickDocs",
    "companyName": "OfficeWare Systems",
    "id": 8,
    "description": "QuickDocs helps you create, edit, and collaborate on documents seamlessly in real time. Whether you’re drafting reports, presentations, or personal notes, QuickDocs provides an intuitive interface and robust tools for formatting, commenting, and sharing. Sync your work across all devices, track revisions, and collaborate with colleagues or friends efficiently. With offline editing, version history, and cloud integration, QuickDocs ensures you never lose important work and can maintain productivity anytime, anywhere. Designed for both professionals and casual users, QuickDocs streamlines document management and collaboration, making work faster, smarter, and more organized.",
    "size": 80.4,
    "reviews": 13200,
    "ratingAvg": 4.4,
    "downloads": 6100000,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1900 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 5800 }
    ]
  }
]
